local AL = LibStub("AceLocale-3.0"):GetLocale("AtlasLoot");
local BabbleInventory = AtlasLoot_GetLocaleLibBabble("LibBabble-Inventory-3.0")
local BabbleFaction = AtlasLoot_GetLocaleLibBabble("LibBabble-Faction-3.0")
local BabbleZone = AtlasLoot_GetLocaleLibBabble("LibBabble-Zone-3.0")



	AtlasLoot_Data["TIslandWeapon"] = {
		{ 2, 23992, "", "=q4=Большой посох поджигателя небес", "Посох"};
		{ 3, 23993, "", "=q4=Беспокойный обсидиановый посох", "Посох"};
		{ 4, 24115, "", "=q4=Бронзовый коготь", "Двуручное, Древковое"};
		{ 5, 24187, "", "=q4=Топор почетного стража Ордоса", "Двуручное, Топор"};
		{ 7, 24191, "", "=q4=Тактический колун надзирателя", "Одноручное, Топор"};
		{ 8, 24491, "", "=q4=Меч вечного стража", "Одноручное, Меч"};
		{ 9, 24515, "", "=q4=Молот чешуйчатого стража", "Одноручное, Дробящее"};
		{ 10, 24518, "", "=q4=Бронзовый нож вечного стража", "Одноручное, Кинжал"};
		{ 11, 25892, "", "=q4=Ордосский жертвенный кинжал", "Одноручное, Кинжал"};
		{ 12, 24541, "", "=q4=Клинок вечного стража", "Одноручное, Меч"};
		{ 13, 34879, "", "=q4=Коготь дракона", "Одноручное, Меч"};
		{ 17, 25709, "", "=q4=Бронзовый оплот стража", "Левая рука, Щит"};
		{ 18, 26529, "", "=q4=Павез бронзового целителя", "Левая рука, Щит"};
		{ 19, 26530, "", "=q4=Бронзовый фолиант стража", "Левая рука"};
		{ 20, 26531, "", "=q4=Скипетр преданного времени", "Левая рука"};
		{ 21, 26532, "", "=q4=Бронзовый лук расхитителя времени", "Лук"};
		Next = "TIslandWeapon2";
		Back = "ISLANDMENU";
	};

	AtlasLoot_Data["TIslandWeapon2"] = {
		{ 2, 26456, "", "=q4=Большой посох поджигателя небес", "Посох"};
		{ 3, 26477, "", "=q4=Беспокойный обсидиановый посох", "Посох"};
		{ 4, 26472, "", "=q4=Бронзовый коготь", "Двуручное, Древковое"};
		{ 5, 26482, "", "=q4=Топор почетного стража Ордоса", "Двуручное, Топор"};
		{ 7, 26474, "", "=q4=Тактический колун надзирателя", "Одноручное, Топор"};
		{ 8, 26483, "", "=q4=Меч вечного стража", "Одноручное, Меч"};
		{ 9, 26475, "", "=q4=Молот чешуйчатого стража", "Одноручное, Дробящее"};
		{ 10, 26484, "", "=q4=Бронзовый нож вечного стража", "Одноручное, Кинжал"};
		{ 11, 26488, "", "=q4=Ордосский жертвенный кинжал", "Одноручное, Кинжал"};
		{ 12, 26476, "", "=q4=Клинок вечного стража", "Одноручное, Меч"};
		{ 13, 26492, "", "=q4=Коготь дракона", "Одноручное, Меч"};
		{ 17, 26485, "", "=q4=Бронзовый оплот стража", "Левая рука, Щит"};
		{ 18, 26494, "", "=q4=Павез бронзового целителя", "Левая рука, Щит"};
		{ 19, 26490, "", "=q4=Бронзовый фолиант стража", "Левая рука"};
		{ 20, 26493, "", "=q4=Скипетр преданного времени", "Левая рука"};
		{ 21, 26491, "", "=q4=Бронзовый лук расхитителя времени", "Лук"};
		Next = "TIslandWeapon3";
		Prev = "TIslandWeapon";
		Back = "ISLANDMENU";
	};

	AtlasLoot_Data["TIslandWeapon3"] = {
		{ 2, 26496, "", "=q4=Большой посох поджигателя небес", "Посох"};
		{ 3, 26501, "", "=q4=Беспокойный обсидиановый посох", "Посох"};
		{ 4, 26497, "", "=q4=Бронзовый коготь", "Двуручное, Древковое"};
		{ 5, 26502, "", "=q4=Топор почетного стража Ордоса", "Двуручное, Топор"};
		{ 7, 26498, "", "=q4=Тактический колун надзирателя", "Одноручное, Топор"};
		{ 8, 26516, "", "=q4=Меч вечного стража", "Одноручное, Меч"};
		{ 9, 26499, "", "=q4=Молот чешуйчатого стража", "Одноручное, Дробящее"};
		{ 10, 26517, "", "=q4=Бронзовый нож вечного стража", "Одноручное, Кинжал"};
		{ 11, 26820, "", "=q4=Ордосский жертвенный кинжал", "Одноручное, Кинжал"};
		{ 12, 26500, "", "=q4=Клинок вечного стража", "Одноручное, Меч"};
		{ 13, 26829, "", "=q4=Коготь дракона", "Одноручное, Меч"};
		{ 17, 26812, "", "=q4=Бронзовый оплот стража", "Левая рука, Щит"};
		{ 18, 26837, "", "=q4=Павез бронзового целителя", "Левая рука, Щит"};
		{ 19, 26821, "", "=q4=Бронзовый фолиант стража", "Левая рука"};
		{ 20, 26836, "", "=q4=Скипетр преданного времени", "Левая рука"};
		{ 21, 26828, "", "=q4=Бронзовый лук расхитителя времени", "Лук"};
		Prev = "TIslandWeapon2";
		Back = "ISLANDMENU";
	};
	
	AtlasLoot_Data["TIslandRing"] = {
		{ 2, 26518, "", "=q4=Печать вневременного стража", "Палец"};
		{ 3, 26519, "", "=q4=Печать вневременного целителя", "Палец"};
		{ 4, 26520, "", "=q4=Печать вневременного завоевателя", "Палец"};
		{ 5, 26521, "", "=q4=Печать вневременного странника", "Палец"};
		{ 6, 26522, "", "=q4=Печать вневременного заклинателя", "Палец"};

		{ 17, 26350, "", "=q4=Печать вневременного стража", "Палец"};
		{ 18, 26348, "", "=q4=Печать вневременного целителя", "Палец"};
		{ 19, 26354, "", "=q4=Печать вневременного завоевателя", "Палец"};
		{ 20, 26349, "", "=q4=Печать вневременного странника", "Палец"};
		{ 21, 26355, "", "=q4=Печать вневременного заклинателя", "Палец"};
	--	Next = "TIslandRing2";
		Back = "ISLANDMENU";
	};

	AtlasLoot_Data["TIslandRing2"] = {
		{ 2, 26348, "", "=q4=Печать вневременного стража", "Палец"};
		{ 3, 26349, "", "=q4=Печать вневременного целителя", "Палец"};
		{ 4, 26350, "", "=q4=Печать вневременного завоевателя", "Палец"};
		{ 5, 26354, "", "=q4=Печать вневременного странника", "Палец"};
		{ 6, 26355, "", "=q4=Печать вневременного заклинателя", "Палец"};
		Prev = "TIslandRing";
		Back = "ISLANDMENU";
	};
	
	AtlasLoot_Data["TIslandBelt"] = {
		{ 2, 26523, "", "=q4=Затерянный во времени пояс восстановления", "Пояс, Ткань"};
		{ 3, 26524, "", "=q4=Затерянный во времени пояс разрушения", "Пояс, Ткань"};
		{ 4, 26528, "", "=q4=Затерянный во времени пояс мудрости", "Пояс, Ткань"};
		{ 5, 26526, "", "=q4=Затерянный во времени пояс странника", "Пояс, Кожа"};
		{ 6, 26544, "", "=q4=Затерянный во времени пояс ловчего", "Пояс, Кольчуга"};
		{ 7, 26525, "", "=q4=Затерянный во времени пояс отваги", "Пояс, Латы"};
		{ 8, 26543, "", "=q4=Затерянный во времени пояс завоевателя", "Пояс, Латы"};

		{ 17, 26453, "", "=q4=Затерянный во времени пояс восстановления", "Пояс, Ткань"};
		{ 18, 26442, "", "=q4=Затерянный во времени пояс разрушения", "Пояс, Ткань"};
		{ 19, 26443, "", "=q4=Затерянный во времени пояс мудрости", "Пояс, Ткань"};
		{ 20, 26451, "", "=q4=Затерянный во времени пояс странника", "Пояс, Кожа"};
		{ 21, 26445, "", "=q4=Затерянный во времени пояс ловчего", "Пояс, Кольчуга"};
		{ 22, 26452, "", "=q4=Затерянный во времени пояс отваги", "Пояс, Латы"};
		{ 23, 26450, "", "=q4=Затерянный во времени пояс завоевателя", "Пояс, Латы"};
	--	Next = "TIslandBelt2";
		Back = "ISLANDMENU";
	};

	AtlasLoot_Data["TIslandBelt2"] = {
		{ 2, 26442, "", "=q4=Затерянный во времени пояс восстановления", "Пояс, Ткань"};
		{ 3, 26443, "", "=q4=Затерянный во времени пояс разрушения", "Пояс, Ткань"};
		{ 4, 26445, "", "=q4=Затерянный во времени пояс мудрости", "Пояс, Ткань"};
		{ 5, 26450, "", "=q4=Затерянный во времени пояс странника", "Пояс, Кожа"};
		{ 6, 26451, "", "=q4=Затерянный во времени пояс ловчего", "Пояс, Кольчуга"};
		{ 7, 26452, "", "=q4=Затерянный во времени пояс отваги", "Пояс, Латы"};
		{ 8, 26453, "", "=q4=Затерянный во времени пояс завоевателя", "Пояс, Латы"};
		Prev = "TIslandBelt";
		Back = "ISLANDMENU";
	};
	
	AtlasLoot_Data["TIslandHood"] = {
		{ 2, 47555, "", "=q4=Мантия странника туманов", "Спина"};
		{ 3, 50500, "", "=q4=Шаль поверженного яунгола", "Спина"};
		{ 4, 50540, "", "=q4=Пелерина странника туманов", "Спина"};
		{ 5, 50549, "", "=q4=Покров рвения странника туманов", "Спина"};
		{ 6, 50590, "", "=q4=Накидка коварства странника туманов", "Спина"};
		{ 7, 50525, "", "=q4=Шаль коварства странника туманов", "Спина"};

		{ 17, 26358, "", "=q4=Мантия странника туманов", "Спина"};
		{ 18, 26362, "", "=q6=Шаль поверженного яунгола", "Спина"};
		{ 19, 26357, "", "=q4=Пелерина странника туманов", "Спина"};
		{ 20, 26363, "", "=q4=Покров рвения странника туманов", "Спина"};
		{ 21, 26356, "", "=q4=Накидка коварства странника туманов", "Спина"};
		{ 22, 50593, "", "=q4=Шаль коварства странника туманов", "Спина"};
	--	Next = "TIslandHood2";
		Back = "ISLANDMENU";
	};

	AtlasLoot_Data["TIslandHood2"] = {
		{ 2, 26356, "", "=q4=Мантия странника туманов", "Спина"};
		{ 3, 26357, "", "=q4=Шаль поверженного яунгола", "Спина"};
		{ 4, 26358, "", "=q4=Пелерина странника туманов", "Спина"};
		{ 5, 26363, "", "=q4=Покров рвения странника туманов", "Спина"};
		{ 6, 26362, "", "=q4=Накидка коварства странника туманов", "Спина"};
		{ 7, 50593, "", "=q4=Шаль коварства странника туманов", "Спина"};
		Prev = "TIslandHood";
		Back = "ISLANDMENU";
	};
	
	AtlasLoot_Data["TIslandTrinket"] = {
		{ 2, 26537, "", "=q4=Выдержка Сюэня", "Аксессуар"};
		{ 3, 26538, "", "=q4=Размышления Чи-Цзи", "Аксессуар"};
		{ 4, 26539, "", "=q4=Укус Юй-лун", "Аксессуар"};
		{ 5, 26540, "", "=q4=Решимость Нюцзао", "Аксессуар"};
		{ 6, 26542, "", "=q4=Созерцание Шаохао", "Аксессуар"};
		Back = "ISLANDMENU";
	};
	
	AtlasLoot_Data["TIslandOther"] = {
		{ 2, 23956, "", "=q4=Модуль манипуляций со временем", ""};
		{ 3, 24010, "", "=q4=Модуль манипуляций со временем", ""};
		{ 5, 40796, "", "=q4=Эликсир поиска сокровищ", ""};
		{ 17, 40796, "", "=q4=Золотистый августейший облачный змей", ""};
		{ 18, 27375, "", "=q4=Небожитель", ""};
		Back = "ISLANDMENU";
	};

	--- Анклав

	AtlasLoot_Data["Balnazar"] = {
		{ 2, 27149, "", "=q4=Пелерина губителя Света", "#s4#"};
		{ 3, 26813, "", "=q4=Сандалии откровения", "#s12#, #a1#"};
		{ 4, 26361, "", "=q4=Ботфорты рассветного охотника", "#s12#, #a3#"};
		{ 5, 26489, "", "=q4=Наголенники губителя Света", "#s12#, #a4#"};
		{ 17, 29847, "", "=q4=Шпора Фрэтли", "#w11#"};
		{ 18, 29849, "", "=q4=Жезл коварства демона", "#w12#"};
		{ 19, 29848, "", "=q4=Жезл возрождения демона", "#w12#"};
		{ 20, 29846, "", "=q4=Эксперимент Б4-Б4Х", "#w5#"};
		Next = "Fretly";
	};

		AtlasLoot_Data["Fretly"] = {
		{ 2, 26511, "", "=q4=Шаль кардинала", "#s4#"};
		{ 3, 26376, "", "=q4=Пояс откровения", "#s10#, #a1#"};
		{ 4, 26352, "", "=q4=Кушак стража дорог", "#s10#, #a2#"};
		{ 5, 26480, "", "=q4=Пояс стража дорог", "#s10#, #a2#"};
		{ 17, 26328, "", "=q4=Ремень рассветного охотника", "#s10#, #a3#"};
		{ 18, 26360, "", "=q4=Пояс губителя Света", "#s10#, #a4#"};
		{ 19, 26336, "", "=q4=Воинский пояс губителя Света", "#s10#, #a4#"};
		{ 20, 26344, "", "=q4=Ремень инквизиции", "#s10#, #a4#"};
		Next = "Hilda";
		Prev = "Balnazar";
	};

		AtlasLoot_Data["Hilda"] = {
		{ 2, 26514, "", "=q4=Накидка командира Алого ордена", "#s4#"};
		{ 3, 26915, "", "=q4=Накулачники откровения", "#s8#, #a1#"};
		{ 4, 26875, "", "=q4=Напульсники стража дорог", "#s8#, #a2#"};
		{ 5, 26891, "", "=q4=Наручи стража дорог", "#s8#, #a2#"};
		{ 17, 26899, "", "=q4=Нарукавники рассветного охотника", "#s8#, #a3#"};
		{ 18, 26907, "", "=q4=Накулачники губителя Света", "#s8#, #a4#"};
		{ 19, 26867, "", "=q4=Наручи губителя Света", "#s8#, #a4#"};
		{ 20, 26883, "", "=q4=Накулачники инквизиции", "#s8#, #a4#"};
		Next = "Beatriss";
		Prev = "Fretly";
	};

		AtlasLoot_Data["Beatriss"] = {
		{ 2, 26515, "", "=q4=Пелерина презренных", "#s4#"};
		{ 3, 27148, "", "=q4=Накидка лазутчика Алого ордена", "#s4#"};
		{ 4, 26512, "", "=q4=Плащ вестника рассвета", "#s4#"};
		{ 6, 29838, "", "=q4=Талисман налетчика Алого ордена", "#s14#"};
		{ 7, 29837, "", "=q4=Фолиант оберегающего Света", "#s14#"};
		{ 8, 29843, "", "=q4=Фолиант карающего Света", "#s14#"};
		{ 17, 26345, "", "=q4=Ботинки стража дорог", "#s12#, #a2#"};
		{ 18, 26353, "", "=q4=Сапоги стража дорог", "#s12#, #a2#"};
		{ 19, 26329, "", "=q4=Башмаки губителя Света", "#s12#, #a4#"};
		{ 20, 26337, "", "=q4=Сапоги инквизиции", "#s12#, #a4#"};
		{ 29, 29845, "", "=q4=Завет Света", "#e12#"};
		Prev = "Hilda";
	};

    AtlasLoot_Data["PriestRunes"] = {
		{ 2, 160083, "", "=q4=Малая руна апатии", "Малая руна"};
		{ 3, 160087, "", "=q4=Малая руна божественного гимна", "Малая руна"};
		{ 4, 160162, "", "=q4=Малая руна взрыва разума", "Малая руна"};
		{ 5, 160085, "", "=q4=Малая руна захвата духа", "Малая руна"};
		{ 6, 160158, "", "=q4=Малая руна кольца света", "Малая руна"};
		{ 7, 160155, "", "=q4=Малая руна массового рассеивания", "Малая руна"};
		{ 8, 160086, "", "=q4=Малая руна молитв", "Малая руна"};
		{ 9, 160088, "", "=q4=Малая руна прозорливости", "Малая руна"};
		{ 10, 160160, "", "=q4=Малая руна пульсации бездны", "Малая руна"};
		{ 11, 160159, "", "=q4=Малая руна разлома бездны", "Малая руна"};
		{ 12, 160157, "", "=q4=Малая руна скорой исповеди", "Малая руна"};
		{ 13, 160161, "", "=q4=Малая руна скорой смерти", "Малая руна"};
		{ 17, 165107, "", "=q4=Великая руна исповеди", "Великая руна"};
		{ 18, 165114, "", "=q4=Великая руна круга исцеления", "Великая руна"};
		{ 19, 165109, "", "=q4=Великая руна придания сил", "Великая руна"};
		{ 20, 165105, "", "=q4=Великая руна слова тьмы", "Великая руна"};
		{ 21, 165102, "", "=q4=Великая руна вспышки безумия", "Великая руна"};
		{ 22, 165111, "", "=q4=Великая руна колодца Света", "Великая руна"};
		--{ 24, 160464, "", "=q4=Разлом бездны", "Спек способность"};
		--{ 25, 160461, "", "=q4=Щит души", "Спек способность"};
		--{ 26, 160463, "", "=q4=Слово силы: Покой", "Спек способность"};
		Back = "Runes";
	};

	AtlasLoot_Data["HunterRunes"] = {
		{ 2, 160041, "", "=q4=Малая руна верного выстрела", "Малая руна"};
		{ 3, 160037, "", "=q4=Малая руна духа зверя", "Малая руна"};
		{ 4, 160042, "", "=q4=Малая руна жестоких укусов", "Малая руна"};
		{ 5, 160040, "", "=q4=Малая руна залпа", "Малая руна"};
		{ 6, 160039, "", "=q4=Малая руна звериного гнева", "Малая руна"};
		{ 7, 160163, "", "=q4=Малая руна избежания", "Малая руна"};
		{ 8, 160153, "", "=q4=Малая руна контратаки", "Малая руна"};
		{ 9, 160046, "", "=q4=Малая руна ложной смерти", "Малая руна"};
		{ 10, 160043, "", "=q4=Малая руна мастера ловушек", "Малая руна"};
		{ 11, 160036, "", "=q4=Малая руна стойла", "Малая руна"};
		{ 12, 160150, "", "=q4=Малая руна удара ящера", "Малая руна"};
		{ 13, 160151, "", "=q4=Малая руна укуса мангуста", "Малая руна"};
		{ 14, 160044, "", "=q4=Малая руна черного мангуста", "Малая руна"};
		{ 15, 160154, "", "=q4=Малая руна черной стрелы", "Малая руна"};
		{ 17, 165167, "", "=q4=Великая руна кусачих выстрелов", "Великая руна"};
		{ 18, 165171, "", "=q4=Великая руна повелителя зверей", "Великая руна"};
		{ 19, 165176, "", "=q4=Великая руна удара мангуста", "Великая руна"};
		{ 20, 165179, "", "=q4=Великая руна гарпуна", "Великая руна"};
		{ 21, 165063, "", "=q4=Великая руна чародейской химеры", "Великая руна"};
		{ 22, 165066, "", "=q4=Великая руна глушащего выстрела", "Великая руна"};
		--{ 27, 160454, "", "=q4=Призыв Хати", "Спек способность"};
		--{ 28, 160487, "", "=q4=Шквальный огонь", "Спек способность"};
		--{ 29, 160500, "", "=q4=Гарпун", "Спек способность"};
		--{ 30, 160499, "", "=q4=Черный укол", "Спек способность"};
		Back = "Runes";
	};

	AtlasLoot_Data["DKRunes"] = {
		{ 2, 160000, "", "=q4=Малая руна воющего ветра", "Малая руна"};
		{ 3, 160001, "", "=q4=Малая руна смертного холода", "Малая руна"};
		{ 4, 160003, "", "=q4=Малая руна машины для убийств", "Малая руна"};
		{ 5, 160004, "", "=q4=Малая руна ударов разложения", "Малая руна"};
		{ 6, 160005, "", "=q4=Малая руна ветерана третьей войны", "Малая руна"};
		{ 7, 160006, "", "=q4=Малая руна неумолимого рока", "Малая руна"};
		{ 8, 160007, "", "=q4=Малая руна кровоотвода", "Малая руна"};
		{ 9, 160008, "", "=q4=Малая руна удушения", "Малая руна"};
		{ 10, 160009, "", "=q4=Малая руна взрыва трупа", "Малая руна"};
		{ 11, 160010, "", "=q4=Малая руна горгульи", "Малая руна"};
		{ 12, 160011, "", "=q4=Малая руна крови вампира", "Малая руна"};
		{ 13, 160014, "", "=q4=Малая руна костаного щита", "Малая руна"};
		{ 14, 160016, "", "=q4=Малая руна несокрушимой брони", "Малая руна"};
		{ 17, 165000, "", "=q4=Великая руна воющего ветра", "Великая руна"};
		{ 18, 165004, "", "=q4=Великая руна машины для убийств", "Великая руна"};
		{ 19, 165209, "", "=q4=Великая руна танцующего рунического оружия", "Великая руна"};
		{ 20, 165213, "", "=q4=Великая руна кровавой бури", "Великая руна"};
		{ 21, 165165, "", "=q4=Великая руна эпидемии", "Великая руна"};
		{ 22, 165057, "", "=q4=Великая руна нечестивости", "Великая руна"};
		{ 23, 165053, "", "=q4=Великая руна кровавого доспеха", "Великая руна"};
		{ 24, 165055, "", "=q4=Великая руна рунического разложения", "Великая руна"};
		--{ 26, 160498, "", "=q4=Вспышка болезни", "Спек способность"};
		--{ 27, 160497, "", "=q4=Трескучий мороз", "Спек способность"};
		--{ 28, 160496, "", "=q4=Кровавая буря", "Спек способность"};
		--{ 29, 160450, "", "=q4=рука поганища", "Спек способность"};
		Back = "Runes";
	};

	AtlasLoot_Data["WarriorRunes"] = {
		{ 2, 160130, "", "=q4=Малая руна внезапной смерти", "Малая руна"};
		{ 3, 160131, "", "=q4=Малая руна смертельного удара", "Малая руна"};
		{ 4, 160133, "", "=q4=Малая руна кровопускания", "Малая руна"};
		{ 5, 160134, "", "=q4=Малая руна силы оружия", "Малая руна"};
		{ 6, 160135, "", "=q4=Малая руна крови и грома", "Малая руна"};
		{ 7, 160136, "", "=q4=Малая руна смертельного раскола", "Малая руна"};
		{ 8, 160137, "", "=q4=Малая руна вихря клинков", "Малая руна"};
		{ 9, 160138, "", "=q4=Малая руна прилива крови", "Малая руна"};
		{ 10, 160139, "", "=q4=Малая руна живительной ярости", "Малая руна"};
		{ 11, 160140, "", "=q4=Малая руна кровожадности", "Малая руна"};
		{ 12, 160142, "", "=q4=Малая руна вихревого раскола", "Малая руна"};
		{ 13, 160143, "", "=q4=Малая руна победного ража", "Малая руна"};
		{ 14, 160145, "", "=q4=Малая руна громогласного крика", "Малая руна"};
		{ 15, 160146, "", "=q4=Малая руна раскалывающего грома", "Малая руна"};
		{ 17, 160147, "", "=q4=Малая руна непреклонной воли", "Малая руна"};
		{ 18, 160148, "", "=q4=Малая руна удара грома", "Малая руна"};
		{ 20, 165013, "", "=q4=Великая руна мощного удара", "Великая руна"};
		{ 21, 165017, "", "=q4=Великая руна мастера клинка", "Великая руна"};
		{ 22, 165019, "", "=q4=Великая руна кровожадности", "Великая руна"};
		{ 23, 165023, "", "=q4=Великая руна жажды смерти", "Великая руна"};
		{ 24, 165025, "", "=q4=Великая руна гнева Торима", "Великая руна"};
		{ 25, 165027, "", "=q4=Великая руна мощи Торима", "Великая руна"};
		--{ 28, 51921, "", "=q4=Доблестный прыжок", "Спек способность"};
		--{ 29, 160466, "", "=q4=Миротворец", "Спек способность"};
		--{ 30, 160465, "", "=q4=Удар колосса", "Спек способность"};
		--{ 31, 160459, "", "=q4=Стойкость к боли", "Спек способность"};
		Back = "Runes";
	};

	AtlasLoot_Data["WarlockRunes"] = {
		{ 2, 160118, "", "=q4=Малая руна изничтожения", "Малая руна"};
		{ 3, 160119, "", "=q4=Малая руна сумерек", "Малая руна"};
		{ 4, 160120, "", "=q4=Малая руна укуса тьмы", "Малая руна"};
		{ 5, 160121, "", "=q4=Малая руна долгих сумерек", "Малая руна"};
		{ 6, 160122, "", "=q4=Малая руна жертвенного костра", "Малая руна"};
		{ 7, 160123, "", "=q4=Малая руна полной власти", "Малая руна"};
		{ 8, 160124, "", "=q4=Малая руна стража Скверны", "Малая руна"};
		{ 9, 160125, "", "=q4=Малая руна метаморфозы", "Малая руна"};
		{ 10, 160126, "", "=q4=Малая руна катаклизма", "Малая руна"};
		{ 11, 160127, "", "=q4=Малая руна поджигания", "Малая руна"};
		{ 12, 160128, "", "=q4=Малая руна неистовства тьмы", "Малая руна"};
		{ 13, 160129, "", "=q4=Малая руна надвигающейся тьмы", "Малая руна"};
		{ 17, 165160, "", "=q4=Великая руна блуждающего духа", "Великая руна"};
		{ 18, 165163, "", "=q4=Великая руна ожога тьмы", "Великая руна"};
		{ 19, 165153, "", "=q4=Великая руна руна хаоса", "Великая руна"};
		{ 20, 165157, "", "=q4=Великая руна ожога души", "Великая руна"};
		--{ 22, 160468, "", "=q4=Пагуба", "Спек способность"};
		--{ 23, 160457, "", "=q4=Рука Гул'дана", "Спек способность"};
		--{ 24, 160467, "", "=q4=Катаклизм", "Спек способность"};
		Back = "Runes";
	};

	AtlasLoot_Data["RogueRunes"] = {
		{ 2, 160089, "", "=q4=Малая руна скорой расправы", "Малая руна"};
		{ 3, 160090, "", "=q4=Малая руна целенаправленных атак", "Малая руна"};
		{ 4, 160091, "", "=q4=Малая руна неутомимости", "Малая руна"};
		{ 5, 160092, "", "=q4=Малая руна гарроты", "Малая руна"};
		{ 6, 160093, "", "=q4=Малая руна внезапных ударов", "Малая руна"};
		{ 7, 160094, "", "=q4=Малая руна грязных приемов", "Малая руна"};
		{ 8, 160095, "", "=q4=Малая руна бегущей тени", "Малая руна"};
		{ 9, 160097, "", "=q4=Малая руна мастера теней", "Малая руна"};
		{ 10, 160099, "", "=q4=Малая руна исчезновения", "Малая руна"};
		{ 11, 160100, "", "=q4=Малая руна танца теней", "Малая руна"};
		{ 12, 160101, "", "=q4=Малая руна смертоносных ударов", "Малая руна"};
		{ 13, 160102, "", "=q4=Малая руна веера клинков", "Малая руна"};
		{ 14, 160103, "", "=q4=Малая руна живучести", "Малая руна"};
		{ 15, 160104, "", "=q4=Малая руна шквала клинков", "Малая руна"};
		{ 17, 165117, "", "=q4=Великая руна гарроты", "Великая руна"};
		{ 18, 165200, "", "=q4=Великая руна расправы", "Великая руна"};
		{ 19, 165125, "", "=q4=Великая руна теней", "Великая руна"};
		{ 20, 165129, "", "=q4=Великая руна удара мрака", "Великая руна"};
		{ 21, 165204, "", "=q4=Великая руна мастера боя", "Великая руна"};
		--{ 26, 160478, "", "=q4=Ядовитая бомба", "Спек способность"};
		--{ 27, 160477, "", "=q4=Черный порох", "Спек способность"};
		--{ 28, 160476, "", "=q4=Удар мрака", "Спек способность"};
		--{ 29, 160474, "", "=q4=Кровавый вихрь", "Спек способность"};
		Back = "Runes";
	};

	AtlasLoot_Data["DruidRunes"] = {
		{ 2, 160018, "", "=q4=Малая руна волшебного огня", "Малая руна"};
		{ 3, 160019, "", "=q4=Малая руна дикого озарения", "Малая руна"};
		{ 4, 160020, "", "=q4=Малая руна крадущегося зверя", "Малая руна"};
		{ 5, 160021, "", "=q4=Малая руна полосования", "Малая руна"};
		{ 6, 160022, "", "=q4=Малая руна глубокой раны", "Малая руна"};
		{ 7, 160023, "", "=q4=Малая руна вызывающего рева", "Малая руна"};
		{ 8, 160024, "", "=q4=Малая руна души леса", "Малая руна"};
		{ 9, 160025, "", "=q4=Малая руна тяжких ран", "Малая руна"};
		{ 10, 160026, "", "=q4=Малая руна жестокого удара", "Малая руна"};
		{ 11, 160027, "", "=q4=Малая руна увечья", "Малая руна"};
		{ 12, 160029, "", "=q4=Малая руна звездопада", "Малая руна"};
		{ 13, 160030, "", "=q4=Малая руна земли и луны", "Малая руна"};
		{ 14, 160031, "", "=q4=Малая руна лунного неистовства", "Малая руна"};
		{ 15, 160032, "", "=q4=Малая руна роя", "Малая руна"};
		{ 17, 160156, "", "=q4=Малая руна устранения яда", "Малая руна"};
		{ 18, 160034, "", "=q4=Малая руна природной стремительности", "Малая руна"};
		{ 19, 160035, "", "=q4=Малая руна спокойствия", "Малая руна"};
		{ 21, 165030, "", "=q4=Великая руна неистовства хищника", "Великая руна"};
		{ 22, 165034, "", "=q4=Великая руна неистовых когтей", "Великая руна"};
		{ 23, 165038, "", "=q4=Великая руна взбучки", "Великая руна"};
		{ 24, 165040, "", "=q4=Великая руна железного меха", "Великая руна"};
		{ 25, 165185, "", "=q4=Великая руна звездного огня", "Великая руна"};
		{ 26, 165191, "", "=q4=Великая руна полной луны", "Великая руна"};
		{ 27, 165182, "", "=q4=Великая руна целительного тайфуна", "Великая руна"};
		{ 28, 165052, "", "=q4=Великая руна щита Кенария", "Великая руна"};
		--{ 30, 160494, "", "=q4=Терзание", "Спек способность"};
		--{ 31, 160492, "", "=q4=Взбучка", "Спек способность"};
		--{ 32, 160490, "", "=q4=Полная луна", "Спек способность"};
		--{ 33, 160489, "", "=q4=Умиротворение", "Спек способность"};
		--{ 34, 160449, "", "=q4=Целительный тайфун", "Спек способность"};
		--{ 35, 160488, "", "=q4=Аватара Сна", "Спек способность"};
		Back = "Runes";
	};

	AtlasLoot_Data["ShamanRunes"] = {
		{ 2, 160105, "", "=q4=Малая руна пронизывающего ветра", "Малая руна"};
		{ 3, 160107, "", "=q4=Малая руна огненного шока", "Малая руна"};
		{ 4, 160108, "", "=q4=Малая руна каменного когтя", "Малая руна"};
		{ 5, 160110, "", "=q4=Малая руна водоворота", "Малая руна"};
		{ 6, 160111, "", "=q4=Малая руна крепости", "Малая руна"};
		{ 7, 160112, "", "=q4=Малая руна удара бури", "Малая руна"};
		{ 8, 160113, "", "=q4=Малая руна оружия духов", "Малая руна"};
		{ 9, 160114, "", "=q4=Малая руна быстрины", "Малая руна"};
		{ 10, 160115, "", "=q4=Малая руна силы прилива", "Малая руна"};
		{ 11, 160116, "", "=q4=Малая руна средоточия исцеления", "Малая руна"};
		{ 17, 165135, "", "=q4=Великая руна удара бури", "Великая руна"};
		{ 18, 165137, "", "=q4=Великая руна вскипания лавы", "Великая руна"};
		{ 19, 165140, "", "=q4=Великая руна бури", "Великая руна"};
		{ 20, 165144, "", "=q4=Великая руна элементаля грома", "Великая руна"};
		{ 21, 165148, "", "=q4=Великая руна быстрины", "Великая руна"};
		{ 22, 165151, "", "=q4=Великая руна силы прилива", "Великая руна"};
		--{ 24, 160473, "", "=q4=Буря", "Спек способность"};
		--{ 25, 160472, "", "=q4=Сокрушающая молния", "Спек способность"};
		--{ 26, 160469, "", "=q4=Покров предков", "Спек способность"};
		Back = "Runes";
	};

	AtlasLoot_Data["MageRunes"] = {
		{ 2, 160048, "", "=q4=Малая руна средоточия льда", "Малая руна"};
		{ 3, 160050, "", "=q4=Малая руна ледяного равновесия", "Малая руна"};
		{ 4, 160051, "", "=q4=Малая руна заморозки мозгов", "Малая руна"};
		{ 5, 160052, "", "=q4=Малая руна ледяного холода", "Малая руна"};
		{ 6, 160054, "", "=q4=Малая руна глубокой заморозки", "Малая руна"};
		{ 7, 160055, "", "=q4=Малая руна средоточия пламени", "Малая руна"};
		{ 8, 160057, "", "=q4=Малая руна возгорания", "Малая руна"};
		{ 9, 160058, "", "=q4=Малая руна пути огня", "Малая руна"};
		{ 10, 160059, "", "=q4=Малая руна воздушного потока", "Малая руна"};
		{ 11, 160061, "", "=q4=Малая руна чародейского средоточия", "Малая руна"};
		{ 12, 160063, "", "=q4=Малая руна чародейского обстрела", "Малая руна"};
		{ 13, 160064, "", "=q4=Малая руна величия разума", "Малая руна"};
		{ 17, 165192, "", "=q4=Великая руна глубокой заморозки", "Великая руна"};
		{ 18, 165196, "", "=q4=Великая руна ледяной стрелы", "Великая руна"};
		{ 19, 165076, "", "=q4=Великая руна возгорания", "Великая руна"};
		{ 20, 165079, "", "=q4=Великая руна выброса пламени", "Великая руна"};
		{ 21, 165071, "", "=q4=Великая руна тайной магии", "Великая руна"};
		{ 22, 165075, "", "=q4=Великая руна чародейского обстрела", "Великая руна"};
		--{ 24, 160485, "", "=q4=Свирепая снежная буря", "Спек способность"};
		--{ 25, 160484, "", "=q4=Ледовый шип", "Спек способность"};
		--{ 26, 160483, "", "=q4=Метеор", "Спек способность"};
		--{ 27, 160482, "", "=q4=Чародейский шар", "Спек способность"};
		Back = "Runes";
	};

	AtlasLoot_Data["PaladinRunes"] = {
		{ 2, 160065, "", "=q4=Малая руна божественного одобрения", "Малая руна"};
		{ 3, 160066, "", "=q4=Малая руна частицы света", "Малая руна"};
		{ 4, 160067, "", "=q4=Малая руна шока небес", "Малая руна"};
		{ 5, 160068, "", "=q4=Малая руна священного щита", "Малая руна"};
		{ 6, 160069, "", "=q4=Малая руна священной отсрочки", "Малая руна"};
		{ 7, 160070, "", "=q4=Малая руна праведного неистовства", "Малая руна"};
		{ 8, 160071, "", "=q4=Малая руна освящения", "Малая руна"};
		{ 9, 160072, "", "=q4=Малая руна щита праведности", "Малая руна"};
		{ 10, 160074, "", "=q4=Малая руна карающего освящения", "Малая руна"};
		{ 11, 160075, "", "=q4=Малая руна экзорцизма", "Малая руна"};
		{ 12, 160076, "", "=q4=Малая руна удара воина света", "Малая руна"};
		{ 13, 160078, "", "=q4=Малая руна божественной бури", "Малая руна"};
		{ 14, 160080, "", "=q4=Малая руна экзорциста", "Малая руна"};
		{ 15, 160081, "", "=q4=Малая руна божественного воздаятеля", "Малая руна"};
		{ 17, 160082, "", "=q4=Малая руна скорого приговора", "Малая руна"};
		{ 19, 165088, "", "=q4=Великая руна шока небес", "Великая руна"};
		{ 20, 165091, "", "=q4=Великая руна божественного одобрения", "Великая руна"};
		{ 21, 165097, "", "=q4=Великая руна щита праведности", "Великая руна"};
		{ 22, 165099, "", "=q4=Великая руна праведника", "Великая руна"};
		{ 23, 165093, "", "=q4=Великая руна скорого воздаяния", "Великая руна"};
		{ 24, 165095, "", "=q4=Великая руна экзорциста", "Великая руна"};
		--{ 26, 160481, "", "=q4=Вдохновение Света", "Спек способность"};
		--{ 27, 160480, "", "=q4=Благословение мстителя", "Спек способность"};
		--{ 28, 160479, "", "=q4=Окончательный приговор", "Спек способность"};
		Back = "Runes";
	};