local AL = LibStub("AceLocale-3.0"):GetLocale("AtlasLoot");
local BabbleInventory = AtlasLoot_GetLocaleLibBabble("LibBabble-Inventory-3.0")
local BabbleFaction = AtlasLoot_GetLocaleLibBabble("LibBabble-Faction-3.0")
local BabbleZone = AtlasLoot_GetLocaleLibBabble("LibBabble-Zone-3.0")



	AtlasLoot_Data["TIslandWeapon"] = {
		{ 2, 23992, "", "=q4=Большой посох поджигателя небес", "Посох"};
		{ 3, 23993, "", "=q4=Беспокойный обсидиановый посох", "Посох"};
		{ 4, 24115, "", "=q4=Бронзовый коготь", "Двуручное, Древковое"};
		{ 5, 24187, "", "=q4=Топор почетного стража Ордоса", "Двуручное, Топор"};
		{ 7, 24191, "", "=q4=Тактический колун надзирателя", "Одноручное, Топор"};
		{ 8, 24491, "", "=q4=Меч вечного стража", "Одноручное, Меч"};
		{ 9, 24515, "", "=q4=Молот чешуйчатого стража", "Одноручное, Дробящее"};
		{ 10, 24518, "", "=q4=Бронзовый нож вечного стража", "Одноручное, Кинжал"};
		{ 11, 25892, "", "=q4=Ордосский жертвенный кинжал", "Одноручное, Кинжал"};
		{ 12, 24541, "", "=q4=Клинок вечного стража", "Одноручное, Меч"};
		{ 13, 34879, "", "=q4=Коготь дракона", "Одноручное, Меч"};
		{ 17, 25709, "", "=q4=Бронзовый оплот стража", "Левая рука, Щит"};
		{ 18, 26529, "", "=q4=Павез бронзового целителя", "Левая рука, Щит"};
		{ 19, 26530, "", "=q4=Бронзовый фолиант стража", "Левая рука"};
		{ 20, 26531, "", "=q4=Скипетр преданного времени", "Левая рука"};
		{ 21, 26532, "", "=q4=Бронзовый лук расхитителя времени", "Лук"};
		Next = "TIslandWeapon2";
		Back = "ISLANDMENU";
	};

	AtlasLoot_Data["TIslandWeapon2"] = {
		{ 2, 26456, "", "=q4=Большой посох поджигателя небес", "Посох"};
		{ 3, 26477, "", "=q4=Беспокойный обсидиановый посох", "Посох"};
		{ 4, 26472, "", "=q4=Бронзовый коготь", "Двуручное, Древковое"};
		{ 5, 26482, "", "=q4=Топор почетного стража Ордоса", "Двуручное, Топор"};
		{ 7, 26474, "", "=q4=Тактический колун надзирателя", "Одноручное, Топор"};
		{ 8, 26483, "", "=q4=Меч вечного стража", "Одноручное, Меч"};
		{ 9, 26475, "", "=q4=Молот чешуйчатого стража", "Одноручное, Дробящее"};
		{ 10, 26484, "", "=q4=Бронзовый нож вечного стража", "Одноручное, Кинжал"};
		{ 11, 26488, "", "=q4=Ордосский жертвенный кинжал", "Одноручное, Кинжал"};
		{ 12, 26476, "", "=q4=Клинок вечного стража", "Одноручное, Меч"};
		{ 13, 26492, "", "=q4=Коготь дракона", "Одноручное, Меч"};
		{ 17, 26485, "", "=q4=Бронзовый оплот стража", "Левая рука, Щит"};
		{ 18, 26494, "", "=q4=Павез бронзового целителя", "Левая рука, Щит"};
		{ 19, 26490, "", "=q4=Бронзовый фолиант стража", "Левая рука"};
		{ 20, 26493, "", "=q4=Скипетр преданного времени", "Левая рука"};
		{ 21, 26491, "", "=q4=Бронзовый лук расхитителя времени", "Лук"};
		Next = "TIslandWeapon3";
		Prev = "TIslandWeapon";
		Back = "ISLANDMENU";
	};

	AtlasLoot_Data["TIslandWeapon3"] = {
		{ 2, 26496, "", "=q4=Большой посох поджигателя небес", "Посох"};
		{ 3, 26501, "", "=q4=Беспокойный обсидиановый посох", "Посох"};
		{ 4, 26497, "", "=q4=Бронзовый коготь", "Двуручное, Древковое"};
		{ 5, 26502, "", "=q4=Топор почетного стража Ордоса", "Двуручное, Топор"};
		{ 7, 26498, "", "=q4=Тактический колун надзирателя", "Одноручное, Топор"};
		{ 8, 26516, "", "=q4=Меч вечного стража", "Одноручное, Меч"};
		{ 9, 26499, "", "=q4=Молот чешуйчатого стража", "Одноручное, Дробящее"};
		{ 10, 26517, "", "=q4=Бронзовый нож вечного стража", "Одноручное, Кинжал"};
		{ 11, 26820, "", "=q4=Ордосский жертвенный кинжал", "Одноручное, Кинжал"};
		{ 12, 26500, "", "=q4=Клинок вечного стража", "Одноручное, Меч"};
		{ 13, 26829, "", "=q4=Коготь дракона", "Одноручное, Меч"};
		{ 17, 26812, "", "=q4=Бронзовый оплот стража", "Левая рука, Щит"};
		{ 18, 26837, "", "=q4=Павез бронзового целителя", "Левая рука, Щит"};
		{ 19, 26821, "", "=q4=Бронзовый фолиант стража", "Левая рука"};
		{ 20, 26836, "", "=q4=Скипетр преданного времени", "Левая рука"};
		{ 21, 26828, "", "=q4=Бронзовый лук расхитителя времени", "Лук"};
		Prev = "TIslandWeapon2";
		Back = "ISLANDMENU";
	};
	
	AtlasLoot_Data["TIslandRing"] = {
		{ 2, 26518, "", "=q4=Печать вневременного стража", "Палец"};
		{ 3, 26519, "", "=q4=Печать вневременного целителя", "Палец"};
		{ 4, 26520, "", "=q4=Печать вневременного завоевателя", "Палец"};
		{ 5, 26521, "", "=q4=Печать вневременного странника", "Палец"};
		{ 6, 26522, "", "=q4=Печать вневременного заклинателя", "Палец"};

		{ 17, 26350, "", "=q4=Печать вневременного стража", "Палец"};
		{ 18, 26348, "", "=q4=Печать вневременного целителя", "Палец"};
		{ 19, 26354, "", "=q4=Печать вневременного завоевателя", "Палец"};
		{ 20, 26349, "", "=q4=Печать вневременного странника", "Палец"};
		{ 21, 26355, "", "=q4=Печать вневременного заклинателя", "Палец"};
	--	Next = "TIslandRing2";
		Back = "ISLANDMENU";
	};

	AtlasLoot_Data["TIslandRing2"] = {
		{ 2, 26348, "", "=q4=Печать вневременного стража", "Палец"};
		{ 3, 26349, "", "=q4=Печать вневременного целителя", "Палец"};
		{ 4, 26350, "", "=q4=Печать вневременного завоевателя", "Палец"};
		{ 5, 26354, "", "=q4=Печать вневременного странника", "Палец"};
		{ 6, 26355, "", "=q4=Печать вневременного заклинателя", "Палец"};
		Prev = "TIslandRing";
		Back = "ISLANDMENU";
	};
	
	AtlasLoot_Data["TIslandBelt"] = {
		{ 2, 26523, "", "=q4=Затерянный во времени пояс восстановления", "Пояс, Ткань"};
		{ 3, 26524, "", "=q4=Затерянный во времени пояс разрушения", "Пояс, Ткань"};
		{ 4, 26528, "", "=q4=Затерянный во времени пояс мудрости", "Пояс, Ткань"};
		{ 5, 26526, "", "=q4=Затерянный во времени пояс странника", "Пояс, Кожа"};
		{ 6, 26544, "", "=q4=Затерянный во времени пояс ловчего", "Пояс, Кольчуга"};
		{ 7, 26525, "", "=q4=Затерянный во времени пояс отваги", "Пояс, Латы"};
		{ 8, 26543, "", "=q4=Затерянный во времени пояс завоевателя", "Пояс, Латы"};

		{ 17, 26453, "", "=q4=Затерянный во времени пояс восстановления", "Пояс, Ткань"};
		{ 18, 26442, "", "=q4=Затерянный во времени пояс разрушения", "Пояс, Ткань"};
		{ 19, 26443, "", "=q4=Затерянный во времени пояс мудрости", "Пояс, Ткань"};
		{ 20, 26451, "", "=q4=Затерянный во времени пояс странника", "Пояс, Кожа"};
		{ 21, 26445, "", "=q4=Затерянный во времени пояс ловчего", "Пояс, Кольчуга"};
		{ 22, 26452, "", "=q4=Затерянный во времени пояс отваги", "Пояс, Латы"};
		{ 23, 26450, "", "=q4=Затерянный во времени пояс завоевателя", "Пояс, Латы"};
	--	Next = "TIslandBelt2";
		Back = "ISLANDMENU";
	};

	AtlasLoot_Data["TIslandBelt2"] = {
		{ 2, 26442, "", "=q4=Затерянный во времени пояс восстановления", "Пояс, Ткань"};
		{ 3, 26443, "", "=q4=Затерянный во времени пояс разрушения", "Пояс, Ткань"};
		{ 4, 26445, "", "=q4=Затерянный во времени пояс мудрости", "Пояс, Ткань"};
		{ 5, 26450, "", "=q4=Затерянный во времени пояс странника", "Пояс, Кожа"};
		{ 6, 26451, "", "=q4=Затерянный во времени пояс ловчего", "Пояс, Кольчуга"};
		{ 7, 26452, "", "=q4=Затерянный во времени пояс отваги", "Пояс, Латы"};
		{ 8, 26453, "", "=q4=Затерянный во времени пояс завоевателя", "Пояс, Латы"};
		Prev = "TIslandBelt";
		Back = "ISLANDMENU";
	};
	
	AtlasLoot_Data["TIslandHood"] = {
		{ 2, 47555, "", "=q4=Мантия странника туманов", "Спина"};
		{ 3, 50500, "", "=q4=Шаль поверженного яунгола", "Спина"};
		{ 4, 50540, "", "=q4=Пелерина странника туманов", "Спина"};
		{ 5, 50549, "", "=q4=Покров рвения странника туманов", "Спина"};
		{ 6, 50590, "", "=q4=Накидка коварства странника туманов", "Спина"};
		{ 7, 50525, "", "=q4=Шаль коварства странника туманов", "Спина"};

		{ 17, 26358, "", "=q4=Мантия странника туманов", "Спина"};
		{ 18, 26362, "", "=q6=Шаль поверженного яунгола", "Спина"};
		{ 19, 26357, "", "=q4=Пелерина странника туманов", "Спина"};
		{ 20, 26363, "", "=q4=Покров рвения странника туманов", "Спина"};
		{ 21, 26356, "", "=q4=Накидка коварства странника туманов", "Спина"};
		{ 22, 50593, "", "=q4=Шаль коварства странника туманов", "Спина"};
	--	Next = "TIslandHood2";
		Back = "ISLANDMENU";
	};

	AtlasLoot_Data["TIslandHood2"] = {
		{ 2, 26356, "", "=q4=Мантия странника туманов", "Спина"};
		{ 3, 26357, "", "=q4=Шаль поверженного яунгола", "Спина"};
		{ 4, 26358, "", "=q4=Пелерина странника туманов", "Спина"};
		{ 5, 26363, "", "=q4=Покров рвения странника туманов", "Спина"};
		{ 6, 26362, "", "=q4=Накидка коварства странника туманов", "Спина"};
		{ 7, 50593, "", "=q4=Шаль коварства странника туманов", "Спина"};
		Prev = "TIslandHood";
		Back = "ISLANDMENU";
	};
	
	AtlasLoot_Data["TIslandTrinket"] = {
		{ 2, 26537, "", "=q4=Выдержка Сюэня", "Аксессуар"};
		{ 3, 26538, "", "=q4=Размышления Чи-Цзи", "Аксессуар"};
		{ 4, 26539, "", "=q4=Укус Юй-лун", "Аксессуар"};
		{ 5, 26540, "", "=q4=Решимость Нюцзао", "Аксессуар"};
		{ 6, 26542, "", "=q4=Созерцание Шаохао", "Аксессуар"};
		Back = "ISLANDMENU";
	};
	
	AtlasLoot_Data["TIslandOther"] = {
		{ 2, 23956, "", "=q4=Модуль манипуляций со временем", ""};
		{ 3, 24010, "", "=q4=Модуль манипуляций со временем", ""};
		{ 5, 40796, "", "=q4=Эликсир поиска сокровищ", ""};
		{ 17, 40796, "", "=q4=Золотистый августейший облачный змей", ""};
		{ 18, 27375, "", "=q4=Небожитель", ""};
		Back = "ISLANDMENU";
	};

	--- Анклав

	AtlasLoot_Data["Balnazar"] = {
		{ 2, 27149, "", "=q4=Пелерина губителя Света", "#s4#"};
		{ 3, 26813, "", "=q4=Сандалии откровения", "#s12#, #a1#"};
		{ 4, 26361, "", "=q4=Ботфорты рассветного охотника", "#s12#, #a3#"};
		{ 5, 26489, "", "=q4=Наголенники губителя Света", "#s12#, #a4#"};
		{ 17, 29847, "", "=q4=Шпора Фрэтли", "#w11#"};
		{ 18, 29849, "", "=q4=Жезл коварства демона", "#w12#"};
		{ 19, 29848, "", "=q4=Жезл возрождения демона", "#w12#"};
		{ 20, 29846, "", "=q4=Эксперимент Б4-Б4Х", "#w5#"};
		Next = "Fretly";
	};

		AtlasLoot_Data["Fretly"] = {
		{ 2, 26511, "", "=q4=Шаль кардинала", "#s4#"};
		{ 3, 26376, "", "=q4=Пояс откровения", "#s10#, #a1#"};
		{ 4, 26352, "", "=q4=Кушак стража дорог", "#s10#, #a2#"};
		{ 5, 26480, "", "=q4=Пояс стража дорог", "#s10#, #a2#"};
		{ 17, 26328, "", "=q4=Ремень рассветного охотника", "#s10#, #a3#"};
		{ 18, 26360, "", "=q4=Пояс губителя Света", "#s10#, #a4#"};
		{ 19, 26336, "", "=q4=Воинский пояс губителя Света", "#s10#, #a4#"};
		{ 20, 26344, "", "=q4=Ремень инквизиции", "#s10#, #a4#"};
		Next = "Hilda";
		Prev = "Balnazar";
	};

		AtlasLoot_Data["Hilda"] = {
		{ 2, 26514, "", "=q4=Накидка командира Алого ордена", "#s4#"};
		{ 3, 26915, "", "=q4=Накулачники откровения", "#s8#, #a1#"};
		{ 4, 26875, "", "=q4=Напульсники стража дорог", "#s8#, #a2#"};
		{ 5, 26891, "", "=q4=Наручи стража дорог", "#s8#, #a2#"};
		{ 17, 26899, "", "=q4=Нарукавники рассветного охотника", "#s8#, #a3#"};
		{ 18, 26907, "", "=q4=Накулачники губителя Света", "#s8#, #a4#"};
		{ 19, 26867, "", "=q4=Наручи губителя Света", "#s8#, #a4#"};
		{ 20, 26883, "", "=q4=Накулачники инквизиции", "#s8#, #a4#"};
		Next = "Beatriss";
		Prev = "Fretly";
	};

		AtlasLoot_Data["Beatriss"] = {
		{ 2, 26515, "", "=q4=Пелерина презренных", "#s4#"};
		{ 3, 27148, "", "=q4=Накидка лазутчика Алого ордена", "#s4#"};
		{ 4, 26512, "", "=q4=Плащ вестника рассвета", "#s4#"};
		{ 6, 29838, "", "=q4=Талисман налетчика Алого ордена", "#s14#"};
		{ 7, 29837, "", "=q4=Фолиант оберегающего Света", "#s14#"};
		{ 8, 29843, "", "=q4=Фолиант карающего Света", "#s14#"};
		{ 17, 26345, "", "=q4=Ботинки стража дорог", "#s12#, #a2#"};
		{ 18, 26353, "", "=q4=Сапоги стража дорог", "#s12#, #a2#"};
		{ 19, 26329, "", "=q4=Башмаки губителя Света", "#s12#, #a4#"};
		{ 20, 26337, "", "=q4=Сапоги инквизиции", "#s12#, #a4#"};
		{ 29, 29845, "", "=q4=Завет Света", "#e12#"};
		Prev = "Hilda";
	};